Зарплата_и_Управление_Персоналом_демо/src/Catalogs/ПакетыДокументовДля1САрхива/ПакетыДокументовДля1САрхива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПакетыДокументовДля1САрхива</name>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>DefinedType.ГрифДоступаБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПередачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Передал</name>
    <type>
      <types>DefinedType.ФизическоеЛицоБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.ПодразделениеБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Принял</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Создал</name>
    <type>
      <types>DefinedType.ФизическоеЛицоБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбменаСАрхивом</name>
    <type>
      <types>EnumRef.СтатусыОбменаС1САрхивом</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственный</name>
    <type>
      <types>DefinedType.СотрудникБИА</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>CatalogRef.ДокументыБИА</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Зарплата_и_Управление_Персоналом_демо/src/Enums/СтатусыОбменаС1САрхивом/СтатусыОбменаС1САрхивом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбменаС1САрхивом</name>
  <enumValues>
    <name>ВыгрузкаВыполнена</name>
  </enumValues>
  <enumValues>
    <name>ГотовКВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВАрхивВыполнена</name>
  </enumValues>
  <enumValues>
    <name>НеГотовКВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>ОбнаруженыОшибкиПриВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>ОбнаруженыОшибкиПриЗагрузкеВАрхив</name>
  </enumValues>
  <enumValues>
    <name>ОбнаруженыОшибкиПриПроверкеВАрхиве</name>
  </enumValues>
  <enumValues>
    <name>ПринятВАрхив</name>
  </enumValues>
</mdclass:Enum>

Зарплата_и_Управление_Персоналом_демо/src/Catalogs/ПакетыДокументовДля1САрхива/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбменСАрхивом.ДоступноРедактированиеПоСтатусу(Объект.СтатусОбменаСАрхивом, Истина) Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	СтатусыОбмена = Перечисления.СтатусыОбменаС1САрхивом;
	ОбнаруженыОшибки = Объект.СтатусОбменаСАрхивом = СтатусыОбмена.ОбнаруженыОшибкиПриВыгрузке
		Или Объект.СтатусОбменаСАрхивом = СтатусыОбмена.ОбнаруженыОшибкиПриЗагрузкеВАрхив
		Или Объект.СтатусОбменаСАрхивом = СтатусыОбмена.ОбнаруженыОшибкиПриПроверкеВАрхиве;
	
	СписокВыбораСтатуса = Элементы.СтатусОбменаСАрхивом.СписокВыбора;
	СписокВыбораСтатуса.Очистить();
	СписокВыбораСтатуса.Добавить(Объект.СтатусОбменаСАрхивом);
	Если Объект.СтатусОбменаСАрхивом = СтатусыОбмена.ГотовКВыгрузке Тогда
		СписокВыбораСтатуса.Добавить(СтатусыОбмена.НеГотовКВыгрузке);
	ИначеЕсли Объект.СтатусОбменаСАрхивом = СтатусыОбмена.НеГотовКВыгрузке Тогда
		СписокВыбораСтатуса.Добавить(СтатусыОбмена.ГотовКВыгрузке);
	ИначеЕсли ОбнаруженыОшибки Тогда
		СписокВыбораСтатуса.Добавить(СтатусыОбмена.ГотовКВыгрузке);
	КонецЕсли;
	
	// Результат проверки отображается только в случае ошибки.
	Элементы.ДекорацияРезультатПроверки.Видимость = ОбнаруженыОшибки;
	
	Элементы.ДатаСоздания.Видимость = ЗначениеЗаполнено(Объект.ДатаСоздания);
	Элементы.ДатаПередачи.Видимость = ЗначениеЗаполнено(Объект.ДатаПередачи);
	Элементы.ДатаПриемки.Видимость = ЗначениеЗаполнено(Объект.ДатаПриемки);
	
	ПометкиДокументов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		Объект.Документы.Выгрузить().ВыгрузитьКолонку("Документ"), "ПометкаУдаления");
	Для Каждого Стр Из Объект.Документы Цикл
		Стр.ПометкаУдаления = ПометкиДокументов[Стр.Документ];
	КонецЦикла;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияРезультатПроверкиНажатие(Элемент)
		
	Если ЗначениеЗаполнено(Объект.РезультатПроверки) Тогда
		ПараметрыФормы = Новый Структура("РезультатПроверки, СтатусВыгрузкиВАрхив", Объект.РезультатПроверки, Объект.СтатусОбменаСАрхивом);
		ОткрытьФорму("Справочник.ПакетыДокументовДля1САрхива.Форма.ФормаРезультатПроверки", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтатусОбменаСАрхивомПриИзменении(Элемент)
	
	Если Объект.СтатусОбменаСАрхивом = ПредопределенноеЗначение(
			"Перечисление.СтатусыОбменаС1САрхивом.ГотовКВыгрузке") Тогда
		Объект.Передал = ОбменСАрхивомВызовСервера.ФизЛицоТекущегоПользователя();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументы

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент = Элементы.ДокументыДокумент Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДокументыДокумент");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Документы.ПометкаУдаления");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементШрифтОформления = ЭлементОформления.Оформление.Элементы.Найти("Шрифт");
	ЭлементШрифтОформления.Значение = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,,,,,Истина);
	ЭлементШрифтОформления.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти
